In [32]:
import pandas as pd

In [33]:
df=pd.read_csv("dataset.csv",usecols=['satisfaction_level','average_montly_hours','promotion_last_5years','salary','left'])

In [34]:
df

,satisfaction_level,average_montly_hours,left,promotion_last_5years,salary
0,0.38,157,1,0,low
1,0.80,262,1,0,medium
2,0.11,272,1,0,medium
3,0.72,223,1,0,low
4,0.37,159,1,0,low
...,...,...,...,...,...
14994,0.40,151,1,0,low
14995,0.37,160,1,0,low
14996,0.37,143,1,0,low
14997,0.11,280,1,0,low
14998,0.37,158,1,0,low

In [35]:
dumies=pd.get_dummies(df.salary,prefix="salary")
dumies

       salary_high  salary_low  salary_medium
0                0           1              0
1                0           0              1
2                0           0              1
3                0           1              0
4                0           1              0
...            ...         ...            ...
14994            0           1              0
14995            0           1              0
14996            0           1              0
14997            0           1              0
14998            0           1              0

[14999 rows x 3 columns]

In [36]:
df=pd.concat([df,dumies],axis='columns')

In [37]:
df.drop('salary',axis='columns',inplace=True)

In [38]:
df

,satisfaction_level,average_montly_hours,left,promotion_last_5years,salary_high,salary_low,salary_medium
0,0.38,157,1,0,0,1,0
1,0.80,262,1,0,0,0,1
2,0.11,272,1,0,0,0,1
3,0.72,223,1,0,0,1,0
4,0.37,159,1,0,0,1,0
...,...,...,...,...,...,...,...
14994,0.40,151,1,0,0,1,0
14995,0.37,160,1,0,0,1,0
14996,0.37,143,1,0,0,1,0
14997,0.11,280,1,0,0,1,0
14998,0.37,158,1,0,0,1,0

In [39]:
y=df['left']

In [40]:
df.drop('left',axis='columns',inplace=True)

In [41]:
X=df

In [42]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.3,random_state=0)

In [43]:
from sklearn.linear_model import LogisticRegression
model=LogisticRegression()
model.fit(X_train,y_train)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='auto', n_jobs=None, penalty='l2',
                   random_state=None, solver='lbfgs', tol=0.0001, verbose=0,
                   warm_start=False)

In [44]:
model.predict(X_test)

array([0, 0, 0, ..., 0, 0, 1], dtype=int64)

In [45]:
model.score(X_test,y_test)

0.7788888888888889